{"basic_info": {"name": "G. Narayanamma Institute of Technology and Science", "short_name": "GNITS", "established": "1997", "type": "Women's Engineering College", "affiliation": "Jawaharlal Nehru Technological University, Hyderabad", "location": "Shaikpet, Hyderabad, Telangana, India", "website": "https://www.gnits.ac.in/", "courses": ["B.Tech", "M.Tech", "MBA"], "departments": ["Computer Science and Engineering", "Information Technology", "Electronics and Communication Engineering", "Electrical and Electronics Engineering", "Mechanical Engineering", "Civil Engineering", "Artificial Intelligence and Data Science", "Business Management"]}, "college_images": ["https://images.unsplash.com/photo-1503676382389-4809596d5290", "https://images.unsplash.com/photo-1523240795612-9a054b0db644", "https://images.unsplash.com/photo-1462536943532-57a629f6cc60", "https://images.unsplash.com/photo-1535982330050-f1c2fb79ff78", "https://images.unsplash.com/photo-1519452575417-564c1401ecc0", "https://images.unsplash.com/photo-1677594334053-afe4b41aa0a3", "https://images.unsplash.com/photo-1498243691581-b145c3f54a5a", "https://images.unsplash.com/photo-1464582920526-52639da1ce12"], "campus_images": ["https://images.unsplash.com/photo-1503676382389-4809596d5290", "https://images.unsplash.com/photo-1462536943532-57a629f6cc60", "https://images.unsplash.com/photo-1535982330050-f1c2fb79ff78", "https://images.unsplash.com/photo-1677594334053-afe4b41aa0a3"], "scraped": {"home": "Creating Future Leaders Through Innovation and Excellence\nGNITS is Beyond Ordinary\nOur programs are designed to equip students with the skills and knowledge needed to excel in today’s rapidly changing technological landscape.\nAcademic\nExcellence\nWe uphold the highest standards in education, preparing students for success in their careers and beyond.\nResearch and Development\nWe drive innovation through active engagement in research, fostering advancements in technology and real-world solutions.\nDiversity, Equity, and Inclusion\nWe create an inclusive environment where diversity is embraced, and everyone has an equal opportunity to succeed.\nFinancial\nIndependence\nWe equip students with the knowledge and skills to achieve financial independence and thrive in their chosen fields.\nEngagement and Growth\nWe encourage active participation in initiatives that contribute to societal growth and positive community impact.\nProviding comprehensive education for All Students\nOur programs are designed to equip students with the skills and knowledge needed to excel in today’s rapidly changing technological landscape.\nBachelors\nPrograms\nManage IT infrastructure, enhance cybersecurity, and provide practical solutions for digital systems.\nMasters\nPrograms\nDevelop software, master algorithms, and apply computing technology to real-world challenges.\nBusiness\nManagement\nTackle real-world challenges in energy and automation through electrical systems and electronics.\nGlobal Marvels in Engineering\nAt GNITS, we believe in shaping the next generation of leaders in technology and engineering. Our programs are designed to provide a robust foundation in engineering principles, coupled with practical skills that prepare our students to excel in the ever-evolving technological landscape\nGuided by Excellence, Driven by Knowledge\nAt GNITS, our students are mentored by a distinguished faculty who combine academic rigor with real-world expertise. This ensures that our graduates are well-prepared to tackle the challenges of their careers with confidence and deep knowledge.\nFueling Entrepreneurial Spirit\nThe Entrepreneur Development Cell at GNITS is the launchpad for turning innovative ideas into thriving ventures. We provide the resources, mentorship, and support needed to nurture entrepreneurial talent and drive business success.\nExplore, Engage, Excel\nGNITS offers a vibrant student life where diverse clubs and organizations empower students to connect, explore new passions, and develop leadership skills, creating a well-rounded educational experience.\nEmpowering Skills for the Future\nOur Skill Enhancement Programs at GNITS are designed to provide students with the practical training and experience needed to excel in a competitive job market, ensuring they are well-prepared for professional success.\nActive Minds, Thriving Spirits\nDescription: GNITS fosters a vibrant sports culture with state-of-the-art facilities and diverse athletic programs. We empower students to maintain physical fitness, excel in sports, and cultivate the teamwork and resilience needed to succeed in every aspect of life.\nResearch at GNITS\nAt GNITS, research is a cornerstone of our academic philosophy, driving innovation and technological advancements. Our Research and Development (R&D) Cell is a dynamic hub that fosters a strong research ecosystem, aligned with the goals of NEP 2020.\nPlacements\nAt GNITS, the commitment to fostering career-ready graduates is evident through its robust placement program. The institution boasts a proactive Training and Placement Cell that coordinates with leading companies across various sectors.\nPeople who made it to the top\nAt GNITS, real-world leadership challenges come to life. Our programs and courses will help you learn how to think expansively, act decisively, and inspire those around you to achieve great things.\nShreya Arukala\nSoftware Engineer, ServiceNow\nI am thrilled to share that I have accepted the Software Development Intern role at ServiceNow! I am eagerly looking forward to working with and learning from talented individuals and gaining hands-on experience in software development. I would like to express my sincere gratitude to my mentors, professors, and friends for their unwavering support and encouragement throughout my journey so far, and I am excited for this new chapter with ServiceNow as a Associate Software Engineer with 42.6 LPA. Thank you, ServiceNow, for this incredible opportunity, I would also like to thank my TPO Dr.Narendrababu Reddy G sir and GNITS-CSE(Data Science) Department for providing me this opportunity.\nJoy Princy\nSoftware Engineer, Microsoft\nI am thrilled to share that, I've been offered a Pre-Placement Offer (PPO) from Microsoft following an exceptional internship experience! And an interview.My journey at Microsoft has been a remarkable learning experience, and I can't wait to embark on this exciting new chapter in my career.And based on my performance I have been placed in Microsoft with a remarkable package of 50 LPA which is really an exciting opportunity to prove myself. I would like to thank my manager RohitBatra and my mentor Akshay Bajaj for their constant support throughout my internship journey.I would aslo like to thank my TPO Dr.Narendrababu Reddy G sir and GNITS-CSE(AI & ML) Department for providing me this opportunity.\nPhanisri Challa\nManager, Deloitte,Hyderabad.\nAs a Manager at Deloitte Consulting and a GNITS alumna, I credit my expertise in Data Integration & Engineering, including Data Lake setups and AWS migrations, to my foundational education at GNITS. My skills in ETL design, Informatica administration, and Unix scripting were honed during my time at the college, where I gained valuable knowledge and experience.\nAshwini Daroga\nProject Manager, HRIS Consultant\nAs a Senior Associate at PwC UK, I credit my career success as a Project Manager and HRIS Consultant to GNITS, where I earned my B. Tech in Information Technology. My foundation from GNITS empowered me to excel at DXC Technology, leading strategic initiatives in Workday HRIS solutions across global domains, showcasing my technical prowess and leadership capabilities.\nHimasree Desai\nFounder & CEO, KitOLit Pvt Ltd, Hyderabad\nAs the Founder and CEO of PixelDatum since 2022 and KitOLit since 2017, I attribute my success in technology and innovation to my foundation at GNITS. With a career journey from Red Pine Signals to Microsoft and Nanomite Technologies, I excel in enterprise data management, IoTEdu-Tech, and business intelligence. My accomplishments underscore GNITS' role in nurturing my skills, empowering me to drive educational and societal advancement through impactful technological solutions.\nMookambica Y\nManager, SnowFlake\nI am a distinguished alumna of GNITS, having completed my B.Tech in Information Technology in 2007. My education at GNITS laid the foundation for my career, fostering skills in IT that I have applied effectively across various high-profile roles in the technology sector.\nKucherlapati Sumedha\nSenior NLP Scientist, Sirona Medical San Francisco Bay Area\nMy experience at G. Narayanamma institute of technology and science in the ETM was invaluable. The engaging coursework and passionate professors inspired me to pursue my goals. The community was welcoming, and the education I received was top-notch.\nsoujanya Mukka\nFounder & CEO - AI Enabled B2B Digitalized Procurement Marketplace (Across 30+ countries in globe currently) Newark, Delaware, United States\nAttending G. Narayanamma institute of technology and science and being part of the Electronics and Telematics Engineering was one of the best decisions I made. The curriculum was challenging yet rewarding, and the faculty were always supportive. It equipped me with the skills and confidence to excel in my career.\nSocial Links\nReach us\nG. Narayanamma Institute of Technology & Science, Autonomous, Shaikpet, Hyderabad – 500104\n+91-040-29565856\n[email protected]", "about": null, "departments": null, "admissions": null, "placements": null, "facilities": null, "contact": null}}